// translations/zh.ts
export default {
    // login screen
    '00000': '试试',
    '00001': '登录',
    '00002': '注册',
    '00003': '忘记密码？',
    '00004': '密码',
    '00005': '或',
  
    // register screen
    '00006': '用户名',
    '00007': '电话号码',
    '00008': '密码',
    '00009': '再次输入密码',
  
    // confirm email
    '00010': '账户验证',
    '00011': '请输入发送到您邮箱的4位验证码',
    '00012': '输入验证码',
    '00013': '验证',
    '00014': '重新发送验证码',
    '00015': '后重新发送验证码',
    '00016': '请输入完整的4位数字',
    '00017': '验证码不正确',
  
    // setting screen
    '00018': '设置',
    '00019': '更改密码',
    '00020': '登录以管理您的行程并获取特别优惠。',
    '00021': '账户管理',
    '00022': '密码与安全',
    '00023': '登出',
    '00024': '个人信息',
    '00032': '语言',
    '00033': '深色模式',
  
    // profile screen
    '00025': '全名',
    '00026': '电话号码',
    '00027': '基本信息',
    '00028': '个人信息',
    '00029': '电话号码',
    '00030': '编辑姓名',
    '00031': '输入您的姓名',
    '00034': '保存更改',
  
    // change pass
    '00035': '当前密码',
    '00036': '新密码',
    '00037': '再次输入新密码',
    '00038': '更改密码',
    '00039': '确认新密码',
  
    // booked
    '00040': '行程列表',
    '00041': '进行中',
    '00042': '已完成',
    '00043': '已取消',
    '00044': '已预订',
  
    // booked status
    '00045': '已入住',
    '00046': '已退房',
    '00047': '待确认',
    '00048': '已确认',
    '00049': '已取消',
  
    // booked detail
    '00050': '预订详情',
    '00051': '您的预订',
    '00052': '订单编号',
    '00053': '已预订房间列表',
    '00054': '价格',
    '00055': '支付信息',
    '00056': '客户姓名',
    '00057': '支付方式',
    '00058': '状态',
    '00059': '总付款',
  
    // saved
    '00060': '已保存',
    '00061': '已保存的房间列表',
    '00062': '尚未保存任何房间',
    '00063': '探索房间',
  
    // home screen
    '00064': '入住日期',
    '00065': '退房日期',
    '00066': '客人',
    '00067': '我们的房间',
    '00068': '查找房间',
    '00069': '享受奢华体验',
    '00070': '酒店与度假村',
  
    // checkroom screen
    '00071': '当前空房',
    '00072': '住宿',
    '00073': '选择',
    '00074': '选择日期',
    '00075': '立即预订',
    '00076': '选择数量',
    '00077': '房间',
    '00078': '删除',
    '00079': '应用更改',
  
    // guest info screen
    '00080': '个人信息',
    '00081': '姓名',
    '00082': '电子邮件地址',
    '00083': '电话号码',
    '00084': '备注',
    '00085': '总金额',
    '00086': '已含税费',
    '00087': '下一步',
  
    // payment screen
    '00088': '支付信息',
    '00089': '付款',
    '00090': '选择支付方式',
    '00091': '现场付款',
    '00092': '已选择房间',
    '00093': '客户姓名',
    '00094': '房间',
    '00095': '总金额',
    '00096': '预订条件',
    '00097': '付款',
  
    // payment info
    '00098': '确认预订',
    '00099': '您的预订',
    '00100': '订单编号',
    '00101': '已预订房间列表',
    '00102': '数量',
    '00103': '已确认',
  
    // payment detail
    '00104': '预订详情',
    '00105': '支付方式',
    '00106': '状态',
    '00107': '总付款',
  
    // tab
    '00108': '搜索',
    '00109': '已保存',
    '00110': '已预订',
    '00111': '设置',
  };
  